[net]
width=640
height=640
channels=3

[convolutional]
batch_normalize=1
filters=64
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=32
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=32
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -6

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -12

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[shortcut]
from=-3
activation=linear

[route]
layers=-1, -12

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=512
size=3
stride=2
pad=1
activation=silu

# C3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[upsample]
stride=2

# Concat

[route]
layers=-1, 39

##########

# C3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[upsample]
stride=2

# Concat

[route]
layers=-1, 24

##########

# C3

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=64
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=128
size=3
stride=2
pad=1
activation=silu

# Concat

[route]
layers=-1, 59

##########

# C3

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=128
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

##########

[convolutional]
batch_normalize=1
filters=256
size=3
stride=2
pad=1
activation=silu

# Concat

[route]
layers=-1, 49

##########

# C3

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[route]
layers=-2

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=1
stride=1
pad=1
activation=silu

[convolutional]
batch_normalize=1
filters=256
size=3
stride=1
pad=1
activation=silu

[route]
layers=-1, -5

[convolutional]
batch_normalize=1
filters=512
size=1
stride=1
pad=1
activation=silu

##########

# Detect

[route]
layers=68

[convolutional]
size=1
stride=1
pad=1
filters=33
activation=logistic

[yolo]
mask=0, 1, 2
anchors=10, 13, 16, 30, 33, 23, 30, 61, 62, 45, 59, 119, 116, 90, 156, 198, 373, 326
classes=6
num=9
scale_x_y=2.0
beta_nms=0.6
new_coords=1

##########

# Detect

[route]
layers=77

[convolutional]
size=1
stride=1
pad=1
filters=33
activation=logistic

[yolo]
mask=3, 4, 5
anchors=10, 13, 16, 30, 33, 23, 30, 61, 62, 45, 59, 119, 116, 90, 156, 198, 373, 326
classes=6
num=9
scale_x_y=2.0
beta_nms=0.6
new_coords=1

##########

# Detect

[route]
layers=90

[convolutional]
size=1
stride=1
pad=1
filters=33
activation=logistic

[yolo]
mask=6, 7, 8
anchors=10, 13, 16, 30, 33, 23, 30, 61, 62, 45, 59, 119, 116, 90, 156, 198, 373, 326
classes=6
num=9
scale_x_y=2.0
beta_nms=0.6
new_coords=1

##########
